Repository: Twilight-lxy/windows-powershell-docs-chinese
Catalog: translate/winserver2025-*/Hyper-V/Add-VMAssignableDevice.po
Languages: ps

source: Assigns a device to a virtual machine.
ps: 将一台设备分配给虚拟机。

source: The `Add-VMAssignableDevice` cmdlet assigns a physical device to a specified virtual machine (VM). This is commonly used for tasks such as attaching GPUs or network adapters directly to a VM to enhance performance for specific applications or workloads. The device can be specified through its instance path, location path, or assignable device object.
ps: `Add-VMAssignableDevice cmdlet` 用于将物理设备分配给指定的虚拟机（VM）。该命令常用于将 GPU 或网络适配器直接连接到虚拟机上，从而提升特定应用程序或工作负载的性能。设备的指定方式可以是通过其实例路径、位置路径，或是使用 assignable device object 来进行。

source: This example attaches a physical device, identified by its instance path, to the virtual machine named **MyVM**.
ps: 这个示例将一个物理设备（该设备的唯一标识是通过其实例路径来确定的）连接到名为 **MyVM** 的虚拟机上。

source: Runs the cmdlet in a remote session or on a remote computer. Enter a computer name or a session object, such as the output of a [New-CimSession](/powershell/module/cimcmdlets/new-cimsession) or [Get-CimSession](/powershell/module/cimcmdlets/get-cimsession) cmdlet. The default is the current session on the local computer.
ps: 该 cmdlet 可在远程会话或远程计算机上执行。您可以输入计算机的名称，或者提供一个会话对象，例如通过 [New-CimSession](/powershell/module/cimcmdlets/new-cimsession) 或 [Get-CimSession](/powershell/module/cimcmdlets/get-cimsession) cmdlet 生成的会话对象。默认情况下，该 cmdlet 会在本地计算机的当前会话中执行。

source: Specifies one or more Hyper-V hosts on which the assignable devices are to be retrieved. NetBIOS names, IP addresses, and fully qualified domain names are allowed. The default is the local computer. Use localhost or a dot (`.`) to specify the local computer explicitly.
ps: 指定一个或多个用于检索可分配设备的 Hyper-V 主机。允许使用 NetBIOS 名称、IP 地址或完全 Qualified Domain Name（FQDN）。默认值为本地计算机；可以使用 localhost 或点号（`.`）来明确表示本地计算机。

source: Specifies one or more user accounts that have permission to perform this action. The default is the current user.
ps: 指定一个或多个具有执行此操作权限的用户账户。默认值为当前用户。

source: Represents the Device Instance path in the host machine.
ps: 表示主机上的设备实例路径。

source: Specifies the location path to the assignable device
ps: 指定可分配设备的路径位置。

source: Returns an object for each process that the cmdlet started.
ps: 为每个由该 cmdlet 启动的进程返回一个对象。

source: Specifies the name of the resource pool to which the device is to be assigned.
ps: 指定要将设备分配到的资源池的名称。

source: Specifies the number of the virtual function (VF) of an SR-IOV-capable network adapter assigned to the virtual machine.
ps: 该参数用于指定分配给虚拟机的、支持 SR-IOV（Scalable I/O Virtualization）的网络适配器的虚拟函数（Virtual Function，简称 VF）的编号。

source: Specifies the virtual machine to which the device is to be assigned.
ps: 指定要将设备分配到的虚拟机。

source: Specifies the name of the virtual machine to which the device is to be assigned.
ps: 指定要将设备分配到的虚拟机的名称。

source: Prompts you for confirmation before running the cmdlet.
ps: 在运行该 cmdlet 之前，系统会提示用户确认是否要继续执行该操作。

source: Shows what would happen if the cmdlet runs. The cmdlet is not run.
ps: 显示如果运行了某个命令行工具（cmdlet），将会发生什么。但实际上，这个命令行工具并未被真正执行。

source: This cmdlet supports the common parameters: -Debug, -ErrorAction, -ErrorVariable, -InformationAction, -InformationVariable, -OutVariable, -OutBuffer, -PipelineVariable, -Verbose, -WarningAction, and -WarningVariable. For more information, see
ps: 此 cmdlet 支持以下常见参数：-Debug、-ErrorAction、-ErrorVariable、-InformationAction、-InformationVariable、-OutVariable、-OutBuffer、-PipelineVariable、-Verbose、-WarningAction 和 -WarningVariable。有关更多信息，请参阅
