Repository: Twilight-lxy/windows-powershell-docs-chinese
Catalog: translate/winserver2025-*/module-compatibility.po
Languages: ps

source: This article lists the status of PowerShell 7 with Powershell modules published for other Microsoft products.
ps: 本文列出了PowerShell 7的状态以及为其他Microsoft产品发布的PowerShell模块。

source: PowerShell 7 module compatibility in Windows Server 2025
ps: PowerShell 7 模块在 Windows Server 2025中的兼容性

source: This article contains a list of PowerShell modules published by Microsoft. These modules provide management and support for various Microsoft products and services. They have been updated to work natively with PowerShell 7, or tested for compatibility with PowerShell 7. This list will be updated with new information as more modules are identified and tested.
ps: 本文列出了由微软发布的 PowerShell 模块。这些模块用于管理和支持微软的各种产品和服务。它们已经过更新，可以与 PowerShell 7 无缝配合使用；或者已经过兼容性测试，确保能够与 PowerShell 7 兼容。随着更多模块的被发现和测试，该列表将会持续更新，以包含最新的信息。

source: If you have information to share or issues with specific modules, please submit feedback in the Windows Feedback Hub. For more information, see
ps: 如果您有需要分享的信息，或者对某些特定模块存在疑问，请通过 Windows Feedback Hub 提交反馈。如需了解更多信息，请参阅

source: ## Windows management modules
ps: ## Windows管理模块

source: The Windows management modules are installed in different ways, dependent on the Edition of Windows, and how the module was packaged for that Edition.
ps: Windows的管理模块的安装方式因 Windows 的版本以及该模块针对相应版本的打包方式而有所不同。

source: On Windows Server, use the feature name with the [Install-WindowsFeature][05] cmdlet as an Administrator. For example:
ps: 在 Windows Server 上，您需要以管理员身份使用 [Install-WindowsFeature][05] cmdlet 来安装相应的功能。例如：

source: On Windows 10, the Windows management modules are made available as **Windows Optional Features** or **Windows Capabilities**. The following commands must be run from an elevated session using **Run as administrator**.
ps: 在 Windows 10 中，Windows 的管理模块被归类为 **Windows 可选功能（Windows Optional Features）**或**Windows 功能（Windows Capabilities）**。以下命令必须通过以管理员身份运行的 elevated 会话来执行。

source: For Windows Optional Features
ps: 对于Windows可选功能

source: To get a list of Optional Features, run the following command:
ps: 要获取可选功能的列表，请运行以下命令：

source: To install the feature:
ps: 要安装此功能：

source: For more information see:
ps: 有关更多信息，请参阅：

source: For Windows Capabilities
ps: 适用于Windows功能

source: To get a list of Windows Capabilities, run the following command:
ps: 要获取 Windows 功能列表，请运行以下命令：

source: Notice that the name of the capability package ends with `~~~~0.0.1.0`. You must use the full name to install the capability:
ps: 请注意：该功能包的名称以 `~~~~0.0.1.0` 结尾；因此，在安装该功能时必须使用其完整的名称。

source: Supported OS
ps: 支持的操作系统

source: ### Module list
ps: ### 模块列表

source: Module name
ps: 模块名称

source: Status
ps: 状态

source: ## Notes
ps: ## 备注

source: This module has some minor compatibility issues with formatted output in PowerShell 7. For example, the `Get-WindowsFeature` cmdlet returns the proper object with all properties, but the default display formatting makes some properties appear to be empty. The actual values are available in the object properties using `Select-Object` or by direct member access.
ps: 该模块在 PowerShell 7 中存在一些与格式化输出相关的小问题。例如，`Get-WindowsFeature` cmdlet 可以返回包含所有属性的完整对象，但由于默认显示格式的原因，某些属性看起来是空的；实际上这些属性的值可以通过 `Select-Object` 或直接访问对象的成员来获取。
